; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	image5 - mode
	infrared0 - mode
	infrared2 - mode
	thermograph4 - mode
	spectrograph1 - mode
	GroundStation2 - direction
	GroundStation10 - direction
	Star9 - direction
	GroundStation7 - direction
	GroundStation11 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation8 - direction
	Star12 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image5)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star5)
	(supports instrument1 image3)
	(supports instrument1 infrared0)
	(supports instrument1 image5)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 image5)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph4)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 image5)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image5)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star12)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(have_image Planet13 infrared2)
	(have_image Phenomenon14 thermograph4)
	(have_image Phenomenon15 image3)
	(have_image Phenomenon15 thermograph4)
	(have_image Star16 image5)
	(have_image Star16 image3)
))

)

; plan
1. (turn_to satellite1 planet13 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 planet13)
   goals met: 0 of 6
2. (turn_to satellite0 groundstation7 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 6
3. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 6
4. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
5. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 0 of 6
6. (turn_to satellite0 groundstation1 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
7. (turn_to satellite0 phenomenon15 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 6
8. (take_image satellite0 phenomenon15 instrument1 image3)
   added: (have_image phenomenon15 image3)
   goals met: 1 of 6
9. (turn_to satellite0 star16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star16)
   goals met: 1 of 6
10. (take_image satellite0 star16 instrument1 image3)
   added: (have_image star16 image3)
   goals met: 2 of 6
11. (take_image satellite0 star16 instrument1 image5)
   added: (have_image star16 image5)
   goals met: 3 of 6
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 6
13. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 6
14. (turn_to satellite0 phenomenon14 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 6
15. (turn_to satellite1 star12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star12)
   goals met: 3 of 6
16. (calibrate satellite1 instrument5 star12)
   added: (calibrated instrument5)
   goals met: 3 of 6
17. (turn_to satellite1 planet13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet13)
   goals met: 3 of 6
18. (take_image satellite1 planet13 instrument5 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 4 of 6
19. (turn_to satellite0 star5 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star5)
   goals met: 4 of 6
20. (calibrate satellite0 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 4 of 6
21. (turn_to satellite0 phenomenon14 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 6
22. (take_image satellite0 phenomenon14 instrument2 thermograph4)
   added: (have_image phenomenon14 thermograph4)
   goals met: 5 of 6
23. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 6
24. (take_image satellite0 phenomenon15 instrument2 thermograph4)
   added: (have_image phenomenon15 thermograph4)
   goals met: 6 of 6
